<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"11cd41316c6324598d75aad00b571035c1a8f690e662071c28cdf02e58db9e91","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1108 at https://github.com/cal-itp/data-infra/actions/runs/19838828284","plan_out_hash":"df35f237de08096aa5e0029519829dc0dc1cd0656a27bdb0126e4a40576b045a","plan_hash":"82085b8e24737dbf07190f887f2d0cb65404178d95538ae376885277c37c6f74","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "00iJ/w==" -> (known after apply)
!~      detect_md5hash      = "yfkZas/eBQMAqfz2eXnuDw==" -> "different hash"
!~      generation          = 1764100054963994 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "yfkZas/eBQMAqfz2eXnuDw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "S9xfig==" -> (known after apply)
!~      detect_md5hash      = "GEAgWaMaB3xMcxPCFeJXSg==" -> "different hash"
!~      generation          = 1764100056657852 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "GEAgWaMaB3xMcxPCFeJXSg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1108](https://github.com/cal-itp/data-infra/actions/runs/19838828284)